Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32CX5109BZ36048_SL3.svd
            <register>
               <name>VBCRDATA</name>
               <addressOffset>0x50</addressOffset>
               <fields>
                  <field>
                     <name>VBCRDATA</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WCMCFG</name>
               <addressOffset>0x54</addressOffset>
               <fields>
                  <field>
                     <name>WCM1CFG</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>WCM2CFG</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PMUIENB</name>
               <addressOffset>0x58</addressOffset>
               <fields>
                  <field>
                     <name>ADCBORIEN</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUCKBORIEN</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCMPIEN</name>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WCMIAIEN</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VBCIAIEN</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PMUISTAT</name>
               <addressOffset>0x5c</addressOffset>
               <fields>
                  <field>
                     <name>ADCBORINT</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUCKBORINT</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCMPINT</name>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WCMIAINT</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VBCIAINT</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WCMSIZ</name>
               <addressOffset>0x60</addressOffset>
               <fields>
                  <field>
                     <name>SRAM1_SIZ</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SRAM1_SIZSelect</name>
                        <enumeratedValue>
                           <name>NO_SRAM_RETENTION</name>
                           <description>FlexRAM is completely powered OFF</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>16K_SRAM</name>
                           <description>16K Flex RAM available in retention</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>32K_SRAM</name>
                           <description>32K Flex RAM available in retention</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>PPS</name>
         <version>U1481.0</version>
         <description>PPS</description>
         <baseAddress>0x44001000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x2FC</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>EXTINT0R</name>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>EXTINT0</name>
                     <description>EXTINT0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>EXTINT0Select</name>
                        <enumeratedValue>
                           <name>RPA9</name>
                           <description>RPA9</description>
                           <value>15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA3</name>
                           <description>RPA3</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA7</name>
                           <description>RPA7</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA11</name>
                           <description>RPA11</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB0</name>
                           <description>RPB0</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB4</name>
                           <description>RPB4</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB8</name>
                           <description>RPB8</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB12</name>
                           <description>RPB12</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA2</name>
                           <description>RPA2</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA6</name>
                           <description>RPA6</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA10</name>
                           <description>RPA10</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA14</name>
                           <description>RPA14</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB3</name>
                           <description>RPB3</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB7</name>
                           <description>RPB7</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB11</name>
                           <description>RPB11</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>EXTINT1R</name>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>EXTINT1</name>
                     <description>EXTINT1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>EXTINT1Select</name>
                        <enumeratedValue>
                           <name>RPA0</name>
                           <description>RPA0</description>
                           <value>15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA4</name>
                           <description>RPA4</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA8</name>
                           <description>RPA8</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA12</name>
                           <description>RPA12</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB1</name>
                           <description>RPB1</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB5</name>
                           <description>RPB5</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB9</name>
                           <description>RPB9</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB13</name>
                           <description>RPB13</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA3</name>
                           <description>RPA3</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA7</name>
                           <description>RPA7</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA11</name>
                           <description>RPA11</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB0</name>
                           <description>RPB0</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB4</name>
                           <description>RPB4</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB8</name>
                           <description>RPB8</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB12</name>
                           <description>RPB12</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>EXTINT2R</name>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>EXTINT2</name>
                     <description>EXTINT2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>EXTINT2Select</name>
                        <enumeratedValue>
                           <name>RPA1</name>
                           <description>RPA1</description>
                           <value>15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA5</name>
                           <description>RPA5</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA9</name>
                           <description>RPA9</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA13</name>
                           <description>RPA13</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB2</name>
                           <description>RPB2</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB6</name>
                           <description>RPB6</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB10</name>
                           <description>RPB10</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA0</name>
                           <description>RPA0</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA4</name>
                           <description>RPA4</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA8</name>
                           <description>RPA8</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA12</name>
                           <description>RPA12</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB1</name>
                           <description>RPB1</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB5</name>
                           <description>RPB5</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB9</name>
                           <description>RPB9</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB13</name>
                           <description>RPB13</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>EXTINT3R</name>
               <addressOffset>0xc</addressOffset>
               <fields>
                  <field>
                     <name>EXTINT3</name>
                     <description>EXTINT3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>EXTINT3Select</name>
                        <enumeratedValue>
                           <name>RPA2</name>
                           <description>RPA2</description>
                           <value>15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA6</name>
                           <description>RPA6</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA10</name>
                           <description>RPA10</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA14</name>
                           <description>RPA14</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB3</name>
                           <description>RPB3</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB7</name>
                           <description>RPB7</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB11</name>
                           <description>RPB11</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA1</name>
                           <description>RPA1</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA5</name>
                           <description>RPA5</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA9</name>
                           <description>RPA9</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA13</name>
                           <description>RPA13</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB2</name>
                           <description>RPB2</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB6</name>
                           <description>RPB6</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB10</name>
                           <description>RPB10</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA8</name>
                           <description>RPA8</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
